mikeakohn/naken_asm/include/8051/stc12h.inc
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;
;; STC12H include
;; part of the naken_asm assembler
;;
;; Generated by: Cjacker Huang (cjacker@gmail.com)
;;         Date: 2022-05-21
;;        Parts: STC12H
;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

S4CON equ 0x84
S4BUF equ 0x85
INTCLKO equ 0x8f
P1M1 equ 0x91
P1M0 equ 0x92
P0M1 equ 0x93
P0M0 equ 0x94
P2M1 equ 0x95
P2M0 equ 0x96
S2CON equ 0x9a
S2BUF equ 0x9b
IRCBAND equ 0x9d
LIRTRIM equ 0x9e
IRTRIM equ 0x9f
P_SW1 equ 0xa2
SADDR equ 0xa9
WKTCL equ 0xaa
WKTCH equ 0xab
S3CON equ 0xac
S3BUF equ 0xad
TA equ 0xae
IE2 equ 0xaf
P3M1 equ 0xb1
P3M0 equ 0xb2
P4M1 equ 0xb3
P4M0 equ 0xb4
IP2 equ 0xb5
IP2H equ 0xb6
IPH equ 0xb7
SADEN equ 0xb9
P_SW2 equ 0xba
VOCTRL equ 0xbb
ADC_CONTR equ 0xbc
ADC_RES equ 0xbd
ADC_RESL equ 0xbe
WDT_CONTR equ 0xc1
IAP_DATA equ 0xc2
IAP_ADDRH equ 0xc3
IAP_ADDRL equ 0xc4
IAP_CMD equ 0xc5
IAP_TRIG equ 0xc6
IAP_CONTR equ 0xc7
P5M1 equ 0xc9
P5M0 equ 0xca
P6M1 equ 0xcb
P6M0 equ 0xcc
SPSTAT equ 0xcd
SPCTL equ 0xce
SPDAT equ 0xcf
T4T3M equ 0xd1
T4H equ 0xd2
T4L equ 0xd3
T3H equ 0xd4
T3L equ 0xd5
T2H equ 0xd6
T2L equ 0xd7
CCON equ 0xd8
CMOD equ 0xd9
CCAPM0 equ 0xda
CCAPM1 equ 0xdb
CCAPM2 equ 0xdc
ADCCFG equ 0xde
IP3 equ 0xdf
P7M1 equ 0xe1
P7M0 equ 0xe2
DPS equ 0xe3
DPL1 equ 0xe4
DPH1 equ 0xe5
CMPCR1 equ 0xe6
CMPCR2 equ 0xe7
CL equ 0xe9
CCAP0L equ 0xea
CCAP1L equ 0xeb
CCAP2L equ 0xec
IP3H equ 0xee
AUXINTIF equ 0xef
PCA_PWM0 equ 0xf2
PCA_PWM1 equ 0xf3
PCA_PWM2 equ 0xf4
IAP_TPS equ 0xf5
CH equ 0xf9
CCAP0H equ 0xfa
CCAP1H equ 0xfb
CCAP2H equ 0xfc
RSTCFG equ 0xff
USBCLK equ 0xdc
USBDAT equ 0xec
USBCON equ 0xf4
USBADR equ 0xfc

; xdata

CCAPM3 equ 0xfd54
CCAP3L equ 0xfd55
CCAP3H equ 0xfd56
PCA_PWM3 equ 0xfd57
CKSEL equ 0xfe00
CLKDIV equ 0xfe01
IRC24MCR equ 0xfe02
XOSCCR equ 0xfe03
IRC32KCR equ 0xfe04
MCLKOCR equ 0xfe05
IRC48MCR equ 0xfe07
P0PU equ 0xfe10
P1PU equ 0xfe11
P2PU equ 0xfe12
P3PU equ 0xfe13
P4PU equ 0xfe14
P5PU equ 0xfe15
P6PU equ 0xfe16
P7PU equ 0xfe17
P0NCS equ 0xfe18
P1NCS equ 0xfe19
P2NCS equ 0xfe1a
P3NCS equ 0xfe1b
P4NCS equ 0xfe1c
P5NCS equ 0xfe1d
P6NCS equ 0xfe1e
P7NCS equ 0xfe1f
P0SR equ 0xfe20
P1SR equ 0xfe21
P2SR equ 0xfe22
P3SR equ 0xfe23
P4SR equ 0xfe24
P5SR equ 0xfe25
P6SR equ 0xfe26
P7SR equ 0xfe27
P0DR equ 0xfe28
P1DR equ 0xfe29
P2DR equ 0xfe2a
P3DR equ 0xfe2b
P4DR equ 0xfe2c
P5DR equ 0xfe2d
P6DR equ 0xfe2e
P7DR equ 0xfe2f
P0IE equ 0xfe30
P1IE equ 0xfe31
P2IE equ 0xfe32
P3IE equ 0xfe33
P4IE equ 0xfe34
P5IE equ 0xfe35
P6IE equ 0xfe36
P7IE equ 0xfe37
I2CCFG equ 0xfe80
I2CMSCR equ 0xfe81
I2CMSST equ 0xfe82
I2CSLCR equ 0xfe83
I2CSLST equ 0xfe84
I2CSLADR equ 0xfe85
I2CTXD equ 0xfe86
I2CRXD equ 0xfe87
I2CMSAUX equ 0xfe88
TM2PS equ 0xfea2
TM3PS equ 0xfea3
TM4PS equ 0xfea4
ADCTIM equ 0xfea8
T3T4PIN equ 0xfeac
PWM1_ETRPS equ 0xfeb0
PWM1_ENO equ 0xfeb1
PWM1_PS equ 0xfeb2
PWM1_IOAUX equ 0xfeb3
PWM2_ETRPS equ 0xfeb4
PWM2_ENO equ 0xfeb5
PWM2_PS equ 0xfeb6
PWM2_IOAUX equ 0xfeb7
PWM1_CR1 equ 0xfec0
PWM1_CR2 equ 0xfec1
PWM1_SMCR equ 0xfec2
PWM1_ETR equ 0xfec3
PWM1_IER equ 0xfec4
PWM1_SR1 equ 0xfec5
PWM1_SR2 equ 0xfec6
PWM1_EGR equ 0xfec7
PWM1_CCMR1 equ 0xfec8
PWM1_CCMR2 equ 0xfec9
PWM1_CCMR3 equ 0xfeca
PWM1_CCMR4 equ 0xfecb
PWM1_CCER1 equ 0xfecc
PWM1_CCER2 equ 0xfecd
PWM1_CNTR equ 0xfece
PWM1_CNTRH equ 0xfece
PWM1_CNTRL equ 0xfecf
PWM1_PSCR equ 0xfed0
PWM1_PSCRH equ 0xfed0
PWM1_PSCRL equ 0xfed1
PWM1_ARR equ 0xfed2
PWM1_ARRH equ 0xfed2
PWM1_ARRL equ 0xfed3
PWM1_RCR equ 0xfed4
PWM1_CCR1 equ 0xfed5
PWM1_CCR1H equ 0xfed5
PWM1_CCR1L equ 0xfed6
PWM1_CCR2 equ 0xfed7
PWM1_CCR2H equ 0xfed7
PWM1_CCR2L equ 0xfed8
PWM1_CCR3 equ 0xfed9
PWM1_CCR3H equ 0xfed9
PWM1_CCR3L equ 0xfeda
PWM1_CCR4 equ 0xfedb
PWM1_CCR4H equ 0xfedb
PWM1_CCR4L equ 0xfedc
PWM1_BKR equ 0xfedd
PWM1_DTR equ 0xfede
PWM1_OISR equ 0xfedf
PWM2_CR1 equ 0xfee0
PWM2_CR2 equ 0xfee1
PWM2_SMCR equ 0xfee2
PWM2_ETR equ 0xfee3
PWM2_IER equ 0xfee4
PWM2_SR1 equ 0xfee5
PWM2_SR2 equ 0xfee6
PWM2_EGR equ 0xfee7
PWM2_CCMR1 equ 0xfee8
PWM2_CCMR2 equ 0xfee9
PWM2_CCMR3 equ 0xfeea
PWM2_CCMR4 equ 0xfeeb
PWM2_CCER1 equ 0xfeec
PWM2_CCER2 equ 0xfeed
PWM2_CNTR equ 0xfeee
PWM2_CNTRH equ 0xfeee
PWM2_CNTRL equ 0xfeef
PWM2_PSCR equ 0xfef0
PWM2_PSCRH equ 0xfef0
PWM2_PSCRL equ 0xfef1
PWM2_ARR equ 0xfef2
PWM2_ARRH equ 0xfef2
PWM2_ARRL equ 0xfef3
PWM2_RCR equ 0xfef4
PWM2_CCR1 equ 0xfef5
PWM2_CCR1H equ 0xfef5
PWM2_CCR1L equ 0xfef6
PWM2_CCR2 equ 0xfef7
PWM2_CCR2H equ 0xfef7
PWM2_CCR2L equ 0xfef8
PWM2_CCR3 equ 0xfef9
PWM2_CCR3H equ 0xfef9
PWM2_CCR3L equ 0xfefa
PWM2_CCR4 equ 0xfefb
PWM2_CCR4H equ 0xfefb
PWM2_CCR4L equ 0xfefc
PWM2_BKR equ 0xfefd
PWM2_DTR equ 0xfefe
PWM2_OISR equ 0xfeff
P0INTE equ 0xfd00
P1INTE equ 0xfd01
P2INTE equ 0xfd02
P3INTE equ 0xfd03
P4INTE equ 0xfd04
P5INTE equ 0xfd05
P6INTE equ 0xfd06
P7INTE equ 0xfd07
P0INTF equ 0xfd10
P1INTF equ 0xfd11
P2INTF equ 0xfd12
P3INTF equ 0xfd13
P4INTF equ 0xfd14
P5INTF equ 0xfd15
P6INTF equ 0xfd16
P7INTF equ 0xfd17
P0IM0 equ 0xfd20
P1IM0 equ 0xfd21
P2IM0 equ 0xfd22
P3IM0 equ 0xfd23
P4IM0 equ 0xfd24
P5IM0 equ 0xfd25
P6IM0 equ 0xfd26
P7IM0 equ 0xfd27
P0IM1 equ 0xfd30
P1IM1 equ 0xfd31
P2IM1 equ 0xfd32
P3IM1 equ 0xfd33
P4IM1 equ 0xfd34
P5IM1 equ 0xfd35
P6IM1 equ 0xfd36
P7IM1 equ 0xfd37
MD3 equ 0xfcf0
MD2 equ 0xfcf1
MD1 equ 0xfcf2
MD0 equ 0xfcf3
MD5 equ 0xfcf4
MD4 equ 0xfcf5
dwOP1 equ 0xfcf0
wOP1 equ 0xfcf2
wOP2 equ 0xfcf4
ARCON equ 0xfcf6
OPCON equ 0xfcf7
PWM1 equ 0xfec0
PWM2 equ 0xfee0
